import React, {Component} from 'react';

class IntroData extends Component{
    render(){

        return(
            <div >
                <br />
                <span>宝石争霸是首个建立在维基链生态的大型塔防类去中心化游戏。</span><br />
                <span>玩家在《宝石争霸》中消耗宝石建造防御塔， 防御塔建成后会自动攻击在一定范围内经过的小怪，小怪死亡爆出金币，玩家获得收益。防御塔共有四种类型，每个类型可升级一次以提高攻击能力和收益能力。防御塔等级越高，数量越多，越具有攻击力，玩家收益越高！宝石争霸玩家可通过建塔、升级、打怪来获得WPT令牌，玩家花费宝石越多，可获得WPT令牌也越多。获得数量参考维基天堂平台挖矿机制。</span><br />
                <span>游戏中的防御塔有维护指标，满级维护为100。维护指标随时间推移会越来越低。当维护指标降为0，防御塔停止攻击小怪，不再获得收益。玩家需要使用 3 宝石加满维护值，才能正常工作，满级维护值可以营业 3 天。</span><br /><br />

            </div>
        )
    }
}

export default IntroData;



